#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rancher-mylabs/gh-action-digitalocean/runs/run-D3yMdEHWi6R2fKsk

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_database_cluster.k3s will be created
  + resource "digitalocean_database_cluster" "k3s" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "k3s-database"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "sgp1"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "14"
    }

  # digitalocean_database_firewall.k3s will be created
  + resource "digitalocean_database_firewall" "k3s" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "tag"
          + uuid       = (known after apply)
          + value      = "master-node"
        }
    }

  # digitalocean_database_user.dbuser will be created
  + resource "digitalocean_database_user" "dbuser" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "k3s_user"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_droplet.k3s_agent[0] will be created
  + resource "digitalocean_droplet" "k3s_agent" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "k3s-agent-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + status               = (known after apply)
      + tags                 = [
          + "worker-node",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k3s_agent[1] will be created
  + resource "digitalocean_droplet" "k3s_agent" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "k3s-agent-2"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + status               = (known after apply)
      + tags                 = [
          + "worker-node",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k3s_agent[2] will be created
  + resource "digitalocean_droplet" "k3s_agent" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "k3s-agent-3"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + status               = (known after apply)
      + tags                 = [
          + "worker-node",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k3s_server[0] will be created
  + resource "digitalocean_droplet" "k3s_server" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "k3s-server-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + status               = (known after apply)
      + tags                 = [
          + "master-node",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k3s_server[1] will be created
  + resource "digitalocean_droplet" "k3s_server" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "k3s-server-2"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + status               = (known after apply)
      + tags                 = [
          + "master-node",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_firewall.k3s_firewall will be created
  + resource "digitalocean_firewall" "k3s_firewall" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + name            = "k3s-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)
      + tags            = [
          + "master-node",
          + "worker-node",
        ]

      + inbound_rule {
          + protocol                  = "icmp"
          + source_addresses          = [
              + "10.2.15.0/24",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "1-65535"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.2.15.0/24",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "1-65535"
          + protocol                  = "udp"
          + source_addresses          = [
              + "10.2.15.0/24",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "10.2.15.0/24",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
        }
    }

  # digitalocean_loadbalancer.k3s_lb will be created
  + resource "digitalocean_loadbalancer" "k3s_lb" {
      + algorithm                        = "round_robin"
      + disable_lets_encrypt_dns_records = false
      + droplet_ids                      = (known after apply)
      + droplet_tag                      = "master-node"
      + enable_backend_keepalive         = false
      + enable_proxy_protocol            = false
      + id                               = (known after apply)
      + ip                               = (known after apply)
      + name                             = "k3s-loadbalancer"
      + redirect_http_to_https           = false
      + region                           = "sgp1"
      + size_unit                        = (known after apply)
      + status                           = (known after apply)
      + urn                              = (known after apply)
      + vpc_uuid                         = (known after apply)

      + forwarding_rule {
          + certificate_id   = (known after apply)
          + certificate_name = (known after apply)
          + entry_port       = 6443
          + entry_protocol   = "https"
          + target_port      = 6443
          + target_protocol  = "https"
          + tls_passthrough  = true
        }

      + healthcheck {
          + check_interval_seconds   = 10
          + healthy_threshold        = 5
          + port                     = 6443
          + protocol                 = "tcp"
          + response_timeout_seconds = 5
          + unhealthy_threshold      = 3
        }

      + sticky_sessions {
          + cookie_name        = (known after apply)
          + cookie_ttl_seconds = (known after apply)
          + type               = (known after apply)
        }
    }

  # digitalocean_project.k3s_cluster will be created
  + resource "digitalocean_project" "k3s_cluster" {
      + created_at  = (known after apply)
      + description = "K3s Lightweight Kubernetes Cluster"
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = (known after apply)
      + name        = "k3s-cluster"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "LTKA Project"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # digitalocean_project_resources.k3s_agent_nodes[0] will be created
  + resource "digitalocean_project_resources" "k3s_agent_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_project_resources.k3s_agent_nodes[1] will be created
  + resource "digitalocean_project_resources" "k3s_agent_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_project_resources.k3s_agent_nodes[2] will be created
  + resource "digitalocean_project_resources" "k3s_agent_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_project_resources.k3s_external_db will be created
  + resource "digitalocean_project_resources" "k3s_external_db" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_project_resources.k3s_lb will be created
  + resource "digitalocean_project_resources" "k3s_lb" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_project_resources.k3s_server_nodes[0] will be created
  + resource "digitalocean_project_resources" "k3s_server_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_project_resources.k3s_server_nodes[1] will be created
  + resource "digitalocean_project_resources" "k3s_server_nodes" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_vpc.k3s_vpc will be created
  + resource "digitalocean_vpc" "k3s_vpc" {
      + created_at  = (known after apply)
      + default     = (known after apply)
      + description = "VPC for K3s cluster"
      + id          = (known after apply)
      + ip_range    = "10.2.15.0/24"
      + name        = "k3s-vpc"
      + region      = "sgp1"
      + urn         = (known after apply)
    }

  # random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = false
    }

Plan: 20 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "DIGITALOCEAN_TOKEN" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @ronnyardi, Action: `pull_request`*